src/cfe/АиФ_МСФО/Catalogs/АиФ_ПериметрГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АиФ_ПериметрГруппы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКонсолидацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьВГО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/АиФ_МСФО/Catalogs/АиФ_ПравилаВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АиФ_ПравилаВГО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчетаВыручки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчетаЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/АиФ_МСФО/Catalogs/АиФ_КартаСчетовМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АиФ_КартаСчетовМСФО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСчетаБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяМСФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АиФ_СтатьиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АиФ_ВидыОперацийМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереклассифицироватьВРасходПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/АиФ_МСФО/CommonModules/АиФ_МСФОСервер/Ext/Module.bsl
// АиФ: серверные процедуры слоя МСФО / консолидации.
// Проводки БП не изменяются — работаем только с объектами расширения.

#Область ПрограммныйИнтерфейс

// Возвращает организации периметра, входящие в консолидацию.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Организации
//
Функция ОрганизацииПериметраКонсолидации() Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Периметр.Организация КАК Организация
	|ИЗ
	|	Справочник.АиФ_ПериметрГруппы КАК Периметр
	|ГДЕ
	|	НЕ Периметр.ПометкаУдаления
	|	И Периметр.ВходитВКонсолидацию
	|
	|УПОРЯДОЧИТЬ ПО
	|	Периметр.Порядок";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			Результат.Добавить(Выборка.Организация);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает активные правила исключения ВГО.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция АктивныеПравилаВГО() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Ссылка КАК Правило,
	|	Правила.ОрганизацияПродавец КАК ОрганизацияПродавец,
	|	Правила.ОрганизацияПокупатель КАК ОрганизацияПокупатель,
	|	Правила.КонтрагентПродавец КАК КонтрагентПродавец,
	|	Правила.КонтрагентПокупатель КАК КонтрагентПокупатель,
	|	Правила.КодСчетаВыручки КАК КодСчетаВыручки,
	|	Правила.КодСчетаЗатрат КАК КодСчетаЗатрат
	|ИЗ
	|	Справочник.АиФ_ПравилаВГО КАК Правила
	|ГДЕ
	|	НЕ Правила.ПометкаУдаления
	|	И Правила.Активно";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Карта счетов БП → статьи МСФО (только активные).
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция АктивнаяКартаСчетовМСФО() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Карта.Ссылка КАК Правило,
	|	Карта.КодСчетаБП КАК КодСчетаБП,
	|	Карта.СтатьяМСФО КАК СтатьяМСФО,
	|	Карта.ВидОперации КАК ВидОперации,
	|	Карта.ПереклассифицироватьВРасходПериода КАК ПереклассифицироватьВРасходПериода
	|ИЗ
	|	Справочник.АиФ_КартаСчетовМСФО КАК Карта
	|ГДЕ
	|	НЕ Карта.ПометкаУдаления
	|	И Карта.Активно";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти
